addons/account_edi_ubl_cii/tests/test_files/import/bis3/invoice/be/test_import_invoice_optional_fields.xml

<?xml version='1.0' encoding='UTF-8'?>
<Invoice xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2" xmlns:ext="urn:oasis:names:specification:ubl:schema:xsd:CommonExtensionComponents-2">
    <cbc:CustomizationID>urn:cen.eu:en16931:2017#compliant#urn:fdc:peppol.eu:2017:poacc:billing:3.0</cbc:CustomizationID>
    <cbc:ProfileID>urn:fdc:peppol.eu:2017:poacc:billing:01:1.0</cbc:ProfileID>
    <cbc:ID>INV/2026/00007</cbc:ID>
    <cbc:IssueDate>2026-02-27</cbc:IssueDate>
    <cbc:DueDate>2026-02-27</cbc:DueDate>
    <cbc:InvoiceTypeCode>380</cbc:InvoiceTypeCode>
    <cbc:TaxPointDate>2026-02-28</cbc:TaxPointDate>
    <cbc:DocumentCurrencyCode>EUR</cbc:DocumentCurrencyCode>
    <cbc:AccountingCost>123</cbc:AccountingCost>
    <cac:InvoicePeriod>
        <cbc:StartDate>2026-02-27</cbc:StartDate>
        <cbc:EndDate>2026-02-28</cbc:EndDate>
    </cac:InvoicePeriod>
    <cac:OrderReference>
        <cbc:ID>whatever_peppol_order_reference_id</cbc:ID>
    </cac:OrderReference>
    <cac:DespatchDocumentReference>
        <cbc:ID>whatever_peppol_despatch_document_reference_id</cbc:ID>
    </cac:DespatchDocumentReference>
    <cac:ContractDocumentReference>
        <cbc:ID>whatever_peppol_contract_document_reference_id</cbc:ID>
    </cac:ContractDocumentReference>
    <cac:ProjectReference>
        <cbc:ID>whatever_project_reference_id</cbc:ID>
    </cac:ProjectReference>
    <cac:AccountingSupplierParty>
        <cac:Party>
            <cbc:EndpointID schemeID="0208">0246697724</cbc:EndpointID>
            <cac:PartyIdentification>
                <cbc:ID schemeID="0208">0246697724</cbc:ID>
            </cac:PartyIdentification>
            <cac:PartyName>
                <cbc:Name>BE Company CoA</cbc:Name>
            </cac:PartyName>
            <cac:PostalAddress>
                <cbc:StreetName>1021 Sint-Bernardsesteenweg</cbc:StreetName>
                <cbc:CityName>Antwerpen</cbc:CityName>
                <cbc:PostalZone>2660</cbc:PostalZone>
                <cac:Country>
                <cbc:IdentificationCode>BE</cbc:IdentificationCode>
                </cac:Country>
            </cac:PostalAddress>
            <cac:PartyTaxScheme>
                <cbc:CompanyID>BE0246697724</cbc:CompanyID>
                <cac:TaxScheme>
                <cbc:ID>VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:PartyTaxScheme>
            <cac:PartyLegalEntity>
                <cbc:RegistrationName>BE Company CoA</cbc:RegistrationName>
                <cbc:CompanyID schemeID="0208">0246697724</cbc:CompanyID>
            </cac:PartyLegalEntity>
            <cac:Contact>
                <cbc:Name>BE Company CoA</cbc:Name>
                <cbc:Telephone>+32 470 12 34 56</cbc:Telephone>
                <cbc:ElectronicMail>info@company.beexample.com</cbc:ElectronicMail>
            </cac:Contact>
        </cac:Party>
    </cac:AccountingSupplierParty>
    <cac:AccountingCustomerParty>
        <cac:Party>
            <cbc:EndpointID schemeID="0208">0403048262</cbc:EndpointID>
            <cac:PartyIdentification>
                <cbc:ID schemeID="0208">0403048262</cbc:ID>
            </cac:PartyIdentification>
            <cac:PartyName>
                <cbc:Name>Belgian Shell</cbc:Name>
            </cac:PartyName>
            <cac:PostalAddress>
                <cbc:CityName>Bruxelles</cbc:CityName>
                <cac:Country>
                    <cbc:IdentificationCode>BE</cbc:IdentificationCode>
                </cac:Country>
            </cac:PostalAddress>
            <cac:PartyTaxScheme>
                <cbc:CompanyID>BE0403048262</cbc:CompanyID>
                <cac:TaxScheme>
                    <cbc:ID>VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:PartyTaxScheme>
            <cac:PartyLegalEntity>
                <cbc:RegistrationName>Belgian Shell</cbc:RegistrationName>
                <cbc:CompanyID schemeID="0208">0403048262</cbc:CompanyID>
            </cac:PartyLegalEntity>
            <cac:Contact>
                <cbc:Name>Belgian Shell</cbc:Name>
            </cac:Contact>
        </cac:Party>
    </cac:AccountingCustomerParty>
    <cac:Delivery>
        <cac:DeliveryLocation>
            <cac:Address>
                <cbc:CityName>Bruxelles</cbc:CityName>
                <cac:Country>
                    <cbc:IdentificationCode>BE</cbc:IdentificationCode>
                </cac:Country>
            </cac:Address>
        </cac:DeliveryLocation>
        <cac:DeliveryParty>
            <cac:PartyName>
                <cbc:Name>Belgian Shell</cbc:Name>
            </cac:PartyName>
        </cac:DeliveryParty>
    </cac:Delivery>
    <cac:PaymentMeans>
        <cbc:PaymentMeansCode name="mutually defined">ZZZ</cbc:PaymentMeansCode>
        <cbc:PaymentID>+++000/0000/05858+++</cbc:PaymentID>
    </cac:PaymentMeans>
    <cac:TaxTotal>
        <cbc:TaxAmount currencyID="EUR">1.98</cbc:TaxAmount>
        <cac:TaxSubtotal>
            <cbc:TaxableAmount currencyID="EUR">33.00</cbc:TaxableAmount>
            <cbc:TaxAmount currencyID="EUR">1.98</cbc:TaxAmount>
            <cac:TaxCategory>
                <cbc:ID>S</cbc:ID>
                <cbc:Percent>6.0</cbc:Percent>
                <cac:TaxScheme>
                    <cbc:ID>VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:TaxCategory>
        </cac:TaxSubtotal>
    </cac:TaxTotal>
    <cac:LegalMonetaryTotal>
        <cbc:LineExtensionAmount currencyID="EUR">33.00</cbc:LineExtensionAmount>
        <cbc:TaxExclusiveAmount currencyID="EUR">33.00</cbc:TaxExclusiveAmount>
        <cbc:TaxInclusiveAmount currencyID="EUR">34.98</cbc:TaxInclusiveAmount>
        <cbc:PrepaidAmount currencyID="EUR">0.00</cbc:PrepaidAmount>
        <cbc:PayableAmount currencyID="EUR">34.98</cbc:PayableAmount>
    </cac:LegalMonetaryTotal>
    <cac:InvoiceLine>
        <cbc:ID>1</cbc:ID>
        <cbc:InvoicedQuantity unitCode="C62">1.0</cbc:InvoicedQuantity>
        <cbc:LineExtensionAmount currencyID="EUR">33.00</cbc:LineExtensionAmount>
        <cac:OrderLineReference>
            <cbc:LineID>whatever_order_line_reference_id</cbc:LineID>
        </cac:OrderLineReference>
        <cac:Item>
            <cbc:Name>[E-COM12] Conference Chair (Steel)</cbc:Name>
            <cac:BuyersItemIdentification>
                <cbc:ID>whatever_buyers_item_id</cbc:ID>
            </cac:BuyersItemIdentification>
            <cac:SellersItemIdentification>
                <cbc:ID>E-COM12</cbc:ID>
            </cac:SellersItemIdentification>
            <cac:ClassifiedTaxCategory>
                <cbc:ID>S</cbc:ID>
                <cbc:Percent>6.0</cbc:Percent>
                <cac:TaxScheme>
                    <cbc:ID>VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:ClassifiedTaxCategory>
            <cac:AdditionalItemProperty>
                <cbc:Name>Legs</cbc:Name>
                <cbc:Value>Steel</cbc:Value>
            </cac:AdditionalItemProperty>
        </cac:Item>
        <cac:Price>
            <cbc:PriceAmount currencyID="EUR">33.0</cbc:PriceAmount>
        </cac:Price>
    </cac:InvoiceLine>
</Invoice>
